src/DataProcessors/ЗагрузкаВыпискиБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаВыпискиБанка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСтатей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Доход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Доход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Расход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОбязательныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаОбязательногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ЗагрузкаВыпискиБанка/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийТаблицыЗначений 

&НаКлиенте
Процедура ТаблицаИмпортаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаИмпорта.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьКолонку = (ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыСтатей.Доход"));
	
	Элементы.ТаблицаИмпортаКонтрагент.ТолькоПросмотр = БлокироватьКолонку;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыПоВыписке();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыписку(Команда)
	
	СкопироватьФайлНаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура СкопироватьФайлНаСервер()
	
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Выберите файл выписки (XLSX или CSV)";
    Диалог.Фильтр = "Файлы выписок (*.xlsx; *.csv)|*.xlsx;*.csv|Excel (*.xlsx)|*.xlsx|CSV (*.csv)|*.csv";
    Диалог.МножественныйВыбор = Ложь;
    
    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаНаДиске", ЭтотОбъект);
    Диалог.Показать(ОписаниеОповещения); 
	
КонецПроцедуры  

&НаКлиенте 
Процедура ПослеВыбораФайлаНаДиске(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьНаКлиенте = ВыбранныеФайлы[0];
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СкопироватьФайлНаСерверЗавершение", ЭтотОбъект);

	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении,,,,ПутьНаКлиенте, УникальныйИдентификатор);		

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСерверЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла <> Неопределено Тогда
		
		ИмяФайла = "";
		ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		ТочкаИндекс = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца); 
		Расширение = ?(ТочкаИндекс > 0, НРег(Сред(ИмяФайла, ТочкаИндекс + 1)), "");
		                
		ПрочитатьФайлНаСервере(ОписаниеПомещенногоФайла.Адрес, Расширение);
		
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресФайлаВХранилище, Расширение)
	
	Если Не ЗначениеЗаполнено(АдресФайлаВХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИмпорта.Очистить();
	
	Попытка
	
		Если Расширение = "csv" Тогда
			
			ПрочитатьФайлCSV(АдресФайлаВХранилище);
			
		ИначеЕсли Расширение = "xlsx" Тогда
			
			ПрочитатьФайлXLSX(АдресФайлаВХранилище);
			
		Иначе
			
			ВызватьИсключение "Неподдерживаемый формат файла: " + Расширение;
			
		КонецЕсли;
	
	Исключение
		
		УдалитьИзВременногоХранилища(АдресФайлаВХранилище);
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;  
	
	УдалитьИзВременногоХранилища(АдресФайлаВХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлCSV(АдресФайлаВХранилище)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище); 
	ТекстФайла = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, КодировкаТекста.UTF8);
	
	МассивСтрок = СтрРазделить(ТекстФайла, Символы.ПС + Символы.ВК, Ложь);
	Разделитель = ";"; 
	
	Для Индекс = 1 По МассивСтрок.ВГраница() Цикл
		
		ТекущаяСтрока = СокрЛП(МассивСтрок[Индекс]);		
		Если ПустаяСтрока(ТекущаяСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКолонок = СтрРазделить(ТекущаяСтрока, Разделитель, Истина); 
		Если МассивКолонок.Количество() < 3 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеДаты = РаспарситьДату(СокрЛП(МассивКолонок[0]));
		Если Не ЗначениеЗаполнено(ЗначениеДаты) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСуммы = СтрЗаменить(СокрЛП(МассивКолонок[1]), " ", "");
		СтрокаСуммы = СтрЗаменить(СтрокаСуммы, ",", ".");
		ЗначениеСуммы = Число(СтрокаСуммы);
		
		ЗначениеКомментария = СокрЛП(МассивКолонок[2]);
		
		ЗаполнитьСтрокуТаблицы(ЗначениеДаты, ЗначениеСуммы, ЗначениеКомментария);
		
	КонецЦикла;
	
КонецПроцедуры
		
&НаСервере
Процедура ПрочитатьФайлXLSX(АдресФайлаВХранилище)
	
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище); 
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx"); 
	
	Попытка
		
		ДвоичныеДанные.Записать(ИмяВременногоФайла);  
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
		Высота = ТабДок.ВысотаТаблицы;	
		
		Для НомерСтроки = 2 По Высота Цикл
			
			ЗначениеДатыИсходное = ТабДок.Область(НомерСтроки, 1).Значение;
			
			Если НЕ ЗначениеЗаполнено(ЗначениеДатыИсходное) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеДаты = ПреобразоватьЧислоВДатуИзExcel(ЗначениеДатыИсходное);
			ЗначениеСуммы = ТабДок.Область(НомерСтроки, 2).Значение;
			ЗначениеКомментария = ТабДок.Область(НомерСтроки, 3).Текст;
			
			ЗаполнитьСтрокуТаблицы(ЗначениеДаты, ЗначениеСуммы, ЗначениеКомментария)
			
		КонецЦикла;
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	Исключение  
		
		УдалитьФайлы(ИмяВременногоФайла);
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТаблицы(ЗначениеДаты, ЗначениеСуммы, ЗначениеКомментария)
	
	НоваяСтрока = ТаблицаИмпорта.Добавить();
	НоваяСтрока.Дата = ЗначениеДаты;
	НоваяСтрока.Комментарий = ЗначениеКомментария;
	
	Если ЗначениеСуммы >= 0 Тогда
		НоваяСтрока.Сумма = ЗначениеСуммы;
		НоваяСтрока.ВидОперации = Перечисления.ТипыСтатей.Доход;
	Иначе
		НоваяСтрока.Сумма = -ЗначениеСуммы;
		НоваяСтрока.ВидОперации = Перечисления.ТипыСтатей.Расход;
	КонецЕсли;
	
	НоваяСтрока.Обработать = Истина;
	
КонецПроцедуры 

&НаСервере 
Функция ПреобразоватьЧислоВДатуИзExcel(ЧислоДата)
	
	Если ТипЗнч(ЧислоДата) = Тип("Дата") Тогда
		Возврат ЧислоДата;
	КонецЕсли;
	
	Если ТипЗнч(ЧислоДата) = Тип("Число") Тогда
		
		ДатаНачалаОтсчета = Дата(1899, 12, 30);
		
		Возврат ДатаНачалаОтсчета + ЧислоДата * 86400;
		
	КонецЕсли;
	
	Возврат Дата(1, 1, 1);

КонецФункции 

&НаСервере
Функция РаспарситьДату(СтрокаДаты)
	
	МассивЧастей = СтрРазделить(СтрокаДаты, ".-/");
	
	Если МассивЧастей.Количество() = 3 Тогда
		
		Попытка
		
			Если СтрДлина(МассивЧастей[2]) = 4 Тогда
				Возврат Дата(Число(МассивЧастей[2]), Число(МассивЧастей[1]), Число(МассивЧастей[0]));
			ИначеЕсли СтрДлина(МассивЧастей[0]) = 4 Тогда
				Возврат Дата(Число(МассивЧастей[0]), Число(МассивЧастей[1]), Число(МассивЧастей[2]));
			КонецЕсли;
			
		Исключение
			
			Возврат Дата(1, 1, 1);
			
		КонецПопытки; 
		
	КонецЕсли;
	
	Возврат Дата(1, 1, 1);
	
КонецФункции

&НаКлиенте 
Процедура СоздатьДокументыПоВыписке()
	
	Результат = СоздатьДокументыПоВыпискеНаСервере();  
	
	ТекстСообщения = СтрШаблон("Документов создано: %1", Результат.ДокументовСозданно);
	
	Если Результат.КоличествоПропущеноБезСтатьи > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС 
		+ СтрШаблон("Пропущено (статья не заполнена): %1", Результат.КоличествоПропущеноБезСтатьи);
	КонецЕсли;
	
	Если Результат.КоличествоПропущеноБезКонтрагента > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС 
		+ СтрШаблон("Пропущено (контрагент не заполнен): %1", Результат.КоличествоПропущеноБезКонтрагента);
	КонецЕсли;
	
	Если Результат.ПропущеноОшибкаПроведения > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС 
		+ СтрШаблон("Пропущено (ошибка при проведении): %1", 
		Результат.ПропущеноОшибкаПроведения);
	КонецЕсли;
			
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;	
	Сообщение.Сообщить();

КонецПроцедуры 

&НаСервере
Функция СоздатьДокументыПоВыпискеНаСервере()
	
	КоличествоПропущеноБезСтатьи = 0;
	КоличествоПропущеноБезКонтрагента = 0;
	ПропущеноОшибкаПроведения = 0;
	ДокументовСозданно = 0;
	
	МассивДляУдаления = Новый Массив;
	
	Индекс = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаИмпорта Цикл
		
		Индекс = Индекс + 1;
		
		Если Не СтрокаТаблицы.Обработать Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяДвижения) Тогда
			КоличествоПропущеноБезСтатьи = КоличествоПропущеноБезСтатьи + 1;
			Продолжить;
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) И СтрокаТаблицы.ВидОперации = Перечисления.ТипыСтатей.Расход Тогда
			КоличествоПропущеноБезКонтрагента = КоличествоПропущеноБезКонтрагента + 1;
			Продолжить;
		КонецЕсли; 
		
		Попытка
			
			Если СтрокаТаблицы.ВидОперации = Перечисления.ТипыСтатей.Доход Тогда
				
				НовыйДокумент = Документы.Доход.СоздатьДокумент();
				
				НовыйДокумент.Дата = СтрокаТаблицы.Дата + Индекс;
				НовыйДокумент.Кошелек = Кошелек;
				НовыйДокумент.Сумма = СтрокаТаблицы.Сумма;
				НовыйДокумент.Комментарий = СтрокаТаблицы.Комментарий;
				НовыйДокумент.СтатьяДохода = СтрокаТаблицы.СтатьяДвижения;
				
			Иначе
				
				НовыйДокумент = Документы.Расход.СоздатьДокумент();
				
				НовыйДокумент.Дата = СтрокаТаблицы.Дата + Индекс;
				НовыйДокумент.Кошелек = Кошелек;
				НовыйДокумент.Сумма = СтрокаТаблицы.Сумма;
				НовыйДокумент.Комментарий = СтрокаТаблицы.Комментарий;
				НовыйДокумент.СтатьяРасхода = СтрокаТаблицы.СтатьяДвижения;
				НовыйДокумент.Контрагент = СтрокаТаблицы.Контрагент;
				
			КонецЕсли;   
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокументовСозданно = ДокументовСозданно + 1; 
			МассивДляУдаления.Добавить(СтрокаТаблицы);
			
		Исключение 
			
			ПропущеноОшибкаПроведения = ПропущеноОшибкаПроведения + 1;
			
		КонецПопытки;
		
	КонецЦикла; 
	
	Для Каждого СтрокаКУдалению Из МассивДляУдаления Цикл
        ТаблицаИмпорта.Удалить(СтрокаКУдалению);
    КонецЦикла;
	
    Результат = Новый Структура;
    Результат.Вставить("ДокументовСозданно", ДокументовСозданно);
    Результат.Вставить("КоличествоПропущеноБезСтатьи", КоличествоПропущеноБезСтатьи);
	Результат.Вставить("ПропущеноОшибкаПроведения", ПропущеноОшибкаПроведения);
    Результат.Вставить("КоличествоПропущеноБезКонтрагента", КоличествоПропущеноБезКонтрагента);

	Возврат Результат; 

КонецФункции


#КонецОбласти
